src/Documents/ОприходованиеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОприходованиеЗапасов</Name>
			<BasedOn>
				<xr:Item>Document.ИнвентаризацияЗапасов</xr:Item>
				<xr:Item>Document.НарядЗаказ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Comment>Статья расходов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходов</Name>
							<Comment>Статья расходов</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущество</Name>
					<Comment>Имущество организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ДополнительнаяКолонкаПечатныхФормДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДополнительнаяКолонкаПечатныхФормДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеВыводить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Артикул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Код</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыОтветственныхЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыОтветственныхЛиц</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кладовщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ОприходованиеЗапасов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
	
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументСсылкаОприходованиеЗапасов, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
		
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОприходованиеЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
	|	ОприходованиеЗапасовЗапасы.Ссылка КАК Документ,
	|	ОприходованиеЗапасовЗапасы.Ссылка.Склад КАК Склад,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ОприходованиеЗапасовЗапасы.Ссылка.Дата КАК Период,
	|	ОприходованиеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ОприходованиеЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ОприходованиеЗапасовЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	ОприходованиеЗапасовЗапасы.Количество КАК Количество,
	|	ОприходованиеЗапасовЗапасы.Сумма КАК Сумма,
	|	ОприходованиеЗапасовЗапасы.Цена,
	|	ОприходованиеЗапасовЗапасы.Упаковка
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.ОприходованиеЗапасов.Запасы КАК ОприходованиеЗапасовЗапасы
	|ГДЕ
	|	ОприходованиеЗапасовЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ОприходованиеЗапасовЗапасы.НомерСтроки) КАК НомерСтроки,
	|	ОприходованиеЗапасовЗапасы.Ссылка.Дата КАК Период,
	|	ОприходованиеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ОприходованиеЗапасовЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Имущество)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Имущество)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Запасы)
	|	КОНЕЦ КАК СчетДт,
	|	ВЫБОР
	|		КОГДА ОприходованиеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВводОстатков)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Служебный)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ДоходыПрочие)
	|	КОНЕЦ КАК СчетКт,
	|	ОприходованиеЗапасовЗапасы.Номенклатура КАК СубконтоДт1,
	|	ОприходованиеЗапасовЗапасы.Ссылка.Склад КАК СубконтоДт2,
	|	ВЫБОР
	|		КОГДА ОприходованиеЗапасовЗапасы.Ссылка.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВводОстатков)
	|			ТОГДА ВЫБОР
	|					КОГДА ОприходованиеЗапасовЗапасы.СтатьяДоходов <> ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
	|						ТОГДА ОприходованиеЗапасовЗапасы.СтатьяДоходов
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ИзлишкиЗапасов)
	|				КОНЕЦ
	|	КОНЕЦ КАК СубконтоКт1,
	|	СУММА(ОприходованиеЗапасовЗапасы.Сумма) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ОприходованиеЗапасовЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|					ИЛИ ОприходованиеЗапасовЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Материал)
	|				ТОГДА ОприходованиеЗапасовЗапасы.Количество
	|		КОНЕЦ) КАК Количество,
	|	""Оприходование запасов"" КАК Содержание
	|ПОМЕСТИТЬ ВременнаяТаблицаУправленческий
	|ИЗ
	|	Документ.ОприходованиеЗапасов.Запасы КАК ОприходованиеЗапасовЗапасы
	|ГДЕ
	|	ОприходованиеЗапасовЗапасы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОприходованиеЗапасовЗапасы.Ссылка.Дата,
	|	ОприходованиеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	ОприходованиеЗапасовЗапасы.Номенклатура,
	|	ВЫБОР
	|		КОГДА ОприходованиеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВводОстатков)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Служебный)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ДоходыПрочие)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОприходованиеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВводОстатков)
	|			ТОГДА NULL
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.Номенклатура)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОприходованиеЗапасовЗапасы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВводОстатков)
	|			ТОГДА NULL
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконто.СтатьиДоходовИРасходов)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ОприходованиеЗапасовЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Имущество)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Имущество)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Запасы)
	|	КОНЕЦ,
	|	ОприходованиеЗапасовЗапасы.Ссылка.Склад,
	|	ВЫБОР
	|		КОГДА ОприходованиеЗапасовЗапасы.Ссылка.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОпераций.ВводОстатков)
	|			ТОГДА ВЫБОР
	|					КОГДА ОприходованиеЗапасовЗапасы.СтатьяДоходов <> ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
	|						ТОГДА ОприходованиеЗапасовЗапасы.СтатьяДоходов
	|					ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ИзлишкиЗапасов)
	|				КОНЕЦ
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Ссылка"            , ДокументСсылкаОприходованиеЗапасов);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	
	Запрос.ВыполнитьПакет();
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаОприходованиеЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПартииТоваров(ДокументСсылкаОприходованиеЗапасов, СтруктураДополнительныеСвойства);
	СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства);		
	СформироватьТаблицаУстановкаЦен(ДокументСсылкаОприходованиеЗапасов, СтруктураДополнительныеСвойства);	
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаОприходованиеЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаЗапасыНаСкладах.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаЗапасыНаСкладах.Период КАК Период,
	|	ТаблицаЗапасыНаСкладах.Склад КАК Склад,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Партия КАК Партия,
	|	СУММА(ТаблицаЗапасыНаСкладах.Количество) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыНаСкладах
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыНаСкладах.Период,
	|	ТаблицаЗапасыНаСкладах.Склад,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Партия";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗапасыНаСкладах()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПартииТоваров(ДокументСсылкаОприходованиеЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ТаблицаПартииТоваров.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаПартииТоваров.Период КАК Период,
	|	ТаблицаПартииТоваров.Документ КАК ДокументПоступления,
	|	ТаблицаПартииТоваров.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаПартииТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаПартииТоваров.Склад КАК Склад,
	|	СУММА(ТаблицаПартииТоваров.Количество) КАК Количество,
	|	СУММА(ТаблицаПартииТоваров.Сумма) КАК Стоимость,
	|	ТаблицаПартииТоваров.Партия
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаПартииТоваров
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПартииТоваров.Период,
	|	ТаблицаПартииТоваров.Документ,
	|	ТаблицаПартииТоваров.СтруктурнаяЕдиница,
	|	ТаблицаПартииТоваров.Номенклатура,
	|	ТаблицаПартииТоваров.Склад,
	|	ТаблицаПартииТоваров.Партия";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваров", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ВременнаяТаблицаУправленческий.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ВременнаяТаблицаУправленческий.СубконтоДт1,
	|	ВременнаяТаблицаУправленческий.СубконтоДт2,
	|	ВременнаяТаблицаУправленческий.СубконтоКт1,
	|	ВременнаяТаблицаУправленческий.Сумма,
	|	ВременнаяТаблицаУправленческий.Количество,
	|	ВременнаяТаблицаУправленческий.Содержание
	|ИЗ
	|	ВременнаяТаблицаУправленческий КАК ВременнаяТаблицаУправленческий
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУстановкаЦен(ДокументСсылкаОприходованиеЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаУстановкаЦен.Период КАК Период,
	|	ТаблицаУстановкаЦен.Номенклатура КАК Номенклатура,
	|	ТаблицаУстановкаЦен.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаУстановкаЦен.Документ.ВидЦен КАК ВидЦен,
	|	ТаблицаУстановкаЦен.Упаковка КАК Упаковка,
	|	ТаблицаУстановкаЦен.Цена КАК Цена,
	|	ТаблицаУстановкаЦен.Документ.АвторДокумента КАК Автор,
	|	ИСТИНА КАК Актуальность
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаУстановкаЦен
	|ГДЕ
	|	ТаблицаУстановкаЦен.Цена <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУстановкаЦен.Период,
	|	ТаблицаУстановкаЦен.Номенклатура,
	|	ТаблицаУстановкаЦен.СтруктурнаяЕдиница,
	|	ТаблицаУстановкаЦен.Документ.ВидЦен,
	|	ТаблицаУстановкаЦен.Упаковка,
	|	ТаблицаУстановкаЦен.Цена,
	|	ТаблицаУстановкаЦен.Документ.АвторДокумента";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУстановкаЦен", РезультатЗапроса.Выгрузить());		

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры печати документа.

Функция ПечатьАктаОбОприходованииТоваров(МассивОбъектов, ОбъектыПечати)
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	|	ОприходованиеЗапасов.Ссылка КАК Ссылка,
	|	ОприходованиеЗапасов.Номер,
	|	ОприходованиеЗапасов.Дата,
	|	ОприходованиеЗапасов.Склад,
	|	ПРЕДСТАВЛЕНИЕ(ОприходованиеЗапасов.Склад) КАК СкладПредставление,
	|	ОприходованиеЗапасов.СтруктурнаяЕдиница.Организация КАК Организация,
	|	ОприходованиеЗапасов.СтруктурнаяЕдиница.Организация.Наименование КАК ОрганизацияПредставление,
	|	ОприходованиеЗапасов.СтруктурнаяЕдиница.Организация.Префикс КАК Префикс,
	|	ОприходованиеЗапасов.ДокументОснование КАК ДокументОснование,
	|	ПРЕДСТАВЛЕНИЕ(ОприходованиеЗапасов.ДокументОснование) КАК ОснованиеПредставление,
	|	ОприходованиеЗапасов.СтруктурнаяЕдиница.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств КАК Валюта
	|ИЗ
	|	Документ.ОприходованиеЗапасов КАК ОприходованиеЗапасов
	|ГДЕ
	|	ОприходованиеЗапасов.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОприходованиеЗапасов.Ссылка КАК Ссылка,
	|	ОприходованиеЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
	|	ОприходованиеЗапасовЗапасы.Номенклатура,
	|	ОприходованиеЗапасовЗапасы.Номенклатура.НаименованиеПолное КАК НоменклатураПредставление,
	|	ПРЕДСТАВЛЕНИЕ(ОприходованиеЗапасовЗапасы.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
	|	ОприходованиеЗапасовЗапасы.КоличествоУпаковок КАК Количество,
	|	ОприходованиеЗапасовЗапасы.Цена,
	|	ОприходованиеЗапасовЗапасы.Сумма,
	|	ОприходованиеЗапасовЗапасы.Упаковка,
	|	ОприходованиеЗапасовЗапасы.Партия
	|ИЗ
	|	Документ.ОприходованиеЗапасов.Запасы КАК ОприходованиеЗапасовЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОприходованиеЗапасов КАК ОприходованиеЗапасов
	|		ПО ОприходованиеЗапасовЗапасы.Ссылка = ОприходованиеЗапасов.Ссылка
	|ГДЕ
	|	ОприходованиеЗапасов.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	
	
	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс");
	СинонимДокумента = НСтр("ru='Акт об оприходовании товаров'");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОприходованиеТоваров_АктОбОприходованиеТоваров";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОприходованиеЗапасов.ПФ_MXL_АктОбОприходованиеТоваров");
	
	ОбластьНомерСтроки 	= Макет.ПолучитьОбласть("Заголовок|НомерСтроки");
	ОбластьКодов  		= Макет.ПолучитьОбласть("Заголовок|КолонкаКодов");
	ОбластьТовар  		= Макет.ПолучитьОбласть("Заголовок|Товар");
	ОбластьДанные 		= Макет.ПолучитьОбласть("Заголовок|Данные");
	
	ОбластьОрганизацияСклад = Макет.ПолучитьОбласть("ОрганизацияСклад");
	
	ОбластьОснование 	= Макет.ПолучитьОбласть("Основание");
	
	ОбластьНомераШапка = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
	ОбластьКодовШапка  = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
	ОбластьТоварШапка  = Макет.ПолучитьОбласть("ШапкаТаблицы|Товар");
	ОбластьДанныеШапка = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
	
	Макет.Область("Товар").ШиринаКолонки = Макет.Область("Товар").ШиринаКолонки
	+ Макет.Область("КолонкаКодов").ШиринаКолонки;
	
	ОбластьНомераСтрока = Макет.ПолучитьОбласть("Строка1|НомерСтроки");
	ОбластьКодовСтрока  = Макет.ПолучитьОбласть("Строка1|КолонкаКодов");
	ОбластьТоварСтрока  = Макет.ПолучитьОбласть("Строка1|Товар");
	ОбластьДанныхСтрока = Макет.ПолучитьОбласть("Строка1|Данные");
	
	ОбластьНомераПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы|НомерСтроки");
	ОбластьКодовПодвалТаблицы  = Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаКодов");
	ОбластьТоварПодвалТаблицы  = Макет.ПолучитьОбласть("ПодвалТаблицы|Товар");
	ОбластьДанныхПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы|Данные");
	
	ОбластьНомераПодписиЛиния = Макет.ПолучитьОбласть("ПодписиЛиния|НомерСтроки");
	ОбластьКодовПодписиЛиния  = Макет.ПолучитьОбласть("ПодписиЛиния|КолонкаКодов");
	ОбластьТоварПодписиЛиния  = Макет.ПолучитьОбласть("ПодписиЛиния|Товар");
	ОбластьДанныхПодписиЛиния = Макет.ПолучитьОбласть("ПодписиЛиния|Данные");
	
	ОбластьПодписи       = Макет.ПолучитьОбласть("Подписи");
	ОбластьСуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДокументы = РезультатыЗапроса[0].Выбрать();
	// ВалютаУпр = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ВалютаУправленческогоУчета");	
	ВалютаУпр = ВыборкаДокументы.Валюта;
	ВыборкаПоТабличнымЧастям = РезультатыЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДопКолонка = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ДополнительнаяКолонкаПечатныхФормДокументов");
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ВыводитьКоды = Истина;
		Колонка = "Артикул";
	ИначеЕсли ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		ВыводитьКоды = Истина;
		Колонка = "Код";
	Иначе
		ВыводитьКоды = Ложь;
	КонецЕсли;
	
	ПервыйДокумент = Истина;
	Пока ВыборкаДокументы.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		// Выводим шапку накладной.
		ЗаполнитьЗначенияСвойств(РеквизитыДокумента, ВыборкаДокументы);
		
		ОбластьНомерСтроки.Параметры.ТекстЗаголовка = ФормированиеПечатныхФорм.СформироватьЗаголовокДокумента(РеквизитыДокумента, СинонимДокумента);
		
		ТабДокумент.Вывести(ОбластьНомерСтроки);
		Если ВыводитьКоды Тогда
			ТабДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьТовар);
		ТабДокумент.Присоединить(ОбластьДанные);
		
		ОбластьОрганизацияСклад.Параметры.Заполнить(ВыборкаДокументы);
		ТабДокумент.Вывести(ОбластьОрганизацияСклад);
		
		Если ЗначениеЗаполнено(ВыборкаДокументы.ДокументОснование) Тогда
			ОбластьОснование.Параметры.ОснованиеПредставление = ВыборкаДокументы.ОснованиеПредставление;
			ТабДокумент.Вывести(ОбластьОснование);
		КонецЕсли;
		
		// Вывод шапки.
		ТабДокумент.Вывести(ОбластьНомераШапка);
		
		Если ВыводитьКоды Тогда
			ОбластьКодовШапка.Параметры.ДопКолонка = Колонка;
			ТабДокумент.Присоединить(ОбластьКодовШапка);
		КонецЕсли;
		
		ТабДокумент.Присоединить(ОбластьТоварШапка);
		
		ТабДокумент.Присоединить(ОбластьДанныеШапка);
		
		СуммаВсего = 0;
		ВсегоНаименований = 0;
		
		// Вывод строк.
		ВыборкаПоТабличнымЧастям.НайтиСледующий(Новый Структура("Ссылка",ВыборкаДокументы.Ссылка));
		
		ВыборкаПоСтрокам = ВыборкаПоТабличнымЧастям.Выбрать();
		
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			
			ОбластьНомераСтрока.Параметры.Заполнить(ВыборкаПоСтрокам);
			ТабДокумент.Вывести(ОбластьНомераСтрока);
			
			Если ВыводитьКоды Тогда
				Если Колонка = "Артикул" Тогда
					ОбластьКодовСтрока.Параметры.ДопКолонка = ВыборкаПоСтрокам.Номенклатура.Артикул;
				Иначе
					ОбластьКодовСтрока.Параметры.ДопКолонка = ВыборкаПоСтрокам.Номенклатура.Код;
				КонецЕсли;
				ТабДокумент.Присоединить(ОбластьКодовСтрока);
			КонецЕсли;
			
			// Номенклатура.
			ОбластьТоварСтрока.Параметры.Заполнить(ВыборкаПоСтрокам);
            ОбластьТоварСтрока.Параметры.НоменклатураПредставление = ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(
			ВыборкаПоСтрокам.НоменклатураПредставление,
			Неопределено);
			
			
			ТабДокумент.Присоединить(ОбластьТоварСтрока);
			
			// Данные о ценах, количестве.
			ОбластьДанныхСтрока.Параметры.Заполнить(ВыборкаПоСтрокам);
			Если НЕ ВыборкаПоСтрокам.Упаковка = Справочники.УпаковкиНоменклатуры.ПустаяСсылка() Тогда
				ОбластьДанныхСтрока.Параметры.ЕдиницаИзмеренияПредставление = ВыборкаПоСтрокам.Упаковка.Наименование + " (" + ВыборкаПоСтрокам.Упаковка.Коэффициент + ")";
			КонецЕсли;
			
			ТабДокумент.Присоединить(ОбластьДанныхСтрока);
			
			СуммаВсего = СуммаВсего + ВыборкаПоСтрокам.Сумма;
			ВсегоНаименований = ВсегоНаименований + 1;
			
		КонецЦикла;
		
		// Вывод подвала.
		ТабДокумент.Вывести(ОбластьНомераПодвалТаблицы);
		Если ВыводитьКоды Тогда
			ТабДокумент.Присоединить(ОбластьКодовПодвалТаблицы);
		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьТоварПодвалТаблицы);    
		ТабДокумент.Присоединить(ОбластьДанныхПодвалТаблицы);
		
		// Вывод Суммы прописью.
		ОбластьСуммаПрописью.Параметры.СуммаПрописью = ФормированиеПечатныхФорм.СформироватьСуммуПрописью(СуммаВсего, ВалютаУпр);
		
		ТекстИтоговойСтроки = НСтр("ru = 'Всего наименований %ВсегоНаименований%, на сумму %СуммаВсего%'");
		
		ТекстИтоговойСтроки = СтрЗаменить(ТекстИтоговойСтроки,"%ВсегоНаименований%", ВсегоНаименований);
		ТекстИтоговойСтроки = СтрЗаменить(ТекстИтоговойСтроки,"%СуммаВсего%", ФормированиеПечатныхФорм.СуммаРубКоп(СуммаВсего, ,));
		// ТекстИтоговойСтроки = СтрЗаменить(ТекстИтоговойСтроки,"%ВалютаУпр%", Строка(ВалютаУпр));
		
		ОбластьСуммаПрописью.Параметры.ИтоговаяСтрока = ТекстИтоговойСтроки;
		
		ТабДокумент.Вывести(ОбластьСуммаПрописью);
		
		Кладовщик=ОбщегоНазначенияСтоматология.ПолучитьСрезПоследнихПоОтветсвеннымЛицам(ВыборкаДокументы.Организация,Перечисления.ТипыОтветственныхЛиц.Кладовщик,ВыборкаДокументы.Дата);
		Если Кладовщик.Количество()>0 Тогда 
			ОбластьПодписи.Параметры.Кладовщик=ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(Кладовщик[0].Сотрудник));
		КонецЕсли;
		
		// Вывод подписей.
		//	ОбластьПодписи.Параметры.Ответственный = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(ВыборкаДокументы.Ответственный);
		//	ОбластьПодписи.Параметры.Кладовщик = ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(ВыборкаДокументы.Кладовщик);		
		ТабДокумент.Вывести(ОбластьНомераПодписиЛиния);
		Если ВыводитьКоды Тогда
			ТабДокумент.Присоединить(ОбластьКодовПодписиЛиния);
		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьТоварПодписиЛиния);    
		ТабДокумент.Присоединить(ОбластьДанныхПодписиЛиния);
		
		ТабДокумент.Вывести(ОбластьПодписи);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументы.Ссылка);
		
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
	
КонецФункции

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктОбОприходованииТоваров") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктОбОприходованииТоваров",
		"Акт об оприходовании товаров",
		ПечатьАктаОбОприходованииТоваров(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры

// Функция получения списка печатных форм.
//
Функция ПолучитьСписокПечатныхФорм() Экспорт
	
	Список = Новый СписокЗначений;
	Список.Добавить("АктОбОприходованииТоваров", "Акт об оприходовании товаров", , БиблиотекаКартинок.Документ);
		
	Возврат Список;
	
КонецФункции


#Область ЗагрузкаДанныхИзВнешнегоИсточника

Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт
	
	//
	// Для группы полей действует правило: хотя бы одно поле в группе должно быть выбрано в колонках
	//
	
	ПолноеИмяОбъектаЗаполнения = НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;
	
	ОписаниеТиповСтрока25 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25));
	ОписаниеТиповСтрока30 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(30));
	ОписаниеТиповСтрока50 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50));
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100));
	ОписаниеТиповСтрока150 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150));
	ОписаниеТиповСтрока200 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(200));
	ОписаниеТиповСтрока1000 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1000));
	ОписаниеТиповЧисло15_2 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло15_3 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный));
	
	ЭтоЗапасы = (ПолноеИмяОбъектаЗаполнения = "Документ.ОприходованиеЗапасов.ТабличнаяЧасть.Запасы");
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Родитель", "Группа", ОписаниеТиповСтрока100, ОписаниеТиповКолонка, , , , );
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Код", "Код", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 1, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Штрихкод", "Штрихкод", ОписаниеТиповСтрока200, ОписаниеТиповКолонка, "Номенклатура", 2, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Артикул", "Артикул", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 3, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименование","Номенклатура (наименование)", ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Номенклатура", 4, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименованиеПолное","Номенклатура (полное наименование)", ОписаниеТиповСтрока1000, ОписаниеТиповКолонка, "Номенклатура", 5, , Истина);
	// ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "КодСинхронизации", "Код услуги", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 6,,Истина);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ПартииНоменклатуры");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Партия", "Партия (наименование)", ОписаниеТиповСтрока150, ОписаниеТиповКолонка);	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Количество", "Количество", ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_3, , , Истина);	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Цена", "Цена", ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2, , ,);	
		
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.УпаковкиНоменклатуры");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "УпаковкаПоУмолчанию", "Упаковка поступления", ОписаниеТиповСтрока25, ОписаниеТиповКолонка);
	// ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "УпаковкаПродажи", "Упаковка продажи", ОписаниеТиповСтрока25, ОписаниеТиповКолонка);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Коэффициент", "Коэффициент упаковки", ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2);

КонецПроцедуры

Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
	ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
	
КонецПроцедуры

Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ПараметрыСопоставления, АдресРезультата) Экспорт
	
	НастройкиОбновленияСвойств  = ПараметрыСопоставления.НастройкиЗагрузкиДанных.НастройкиОбновленияСвойств;
	ТаблицаСопоставленияДанных	= ПараметрыСопоставления.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных			= ТаблицаСопоставленияДанных.Количество();
	НастройкиЗагрузкиДанных		= ПараметрыСопоставления.НастройкиЗагрузкиДанных;
	ПолноеИмяОбъектаЗаполнения 	= НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;

	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
		
		// Номенклатура по ШтрихКоду, Артикулу, Наименованию, НаименованиеПолное, Код, КодСинхронизации
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНоменклатуру(СтрокаТаблицыФормы.Номенклатура, 
			СтрокаТаблицыФормы.Штрихкод, 
			СтрокаТаблицыФормы.Артикул, 
			СтрокаТаблицыФормы.НоменклатураНаименование, 
			СтрокаТаблицыФормы.НоменклатураНаименованиеПолное, 
			СтрокаТаблицыФормы.Код);
		ЭтаСтрокаСопоставлена = ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура);
		
		// Родитель по наименованию
		ЗначениеПоУмолчанию = Справочники.Номенклатура.ПустаяСсылка();
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьРодителя("Номенклатура", СтрокаТаблицыФормы.Родитель, СтрокаТаблицыФормы.Родитель_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицыФормы.Родитель)
			И ЗначениеЗаполнено(СтрокаТаблицыФормы.Родитель_ВходящиеДанные) Тогда
			
			ГруппаНоменклатуры = Справочники.Номенклатура.СоздатьГруппу();
			ГруппаНоменклатуры.Наименование = СтрокаТаблицыФормы.Родитель_ВходящиеДанные;
			ГруппаНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас;
			ГруппаНоменклатуры.Записать();
			СтрокаТаблицыФормы.Родитель = ГруппаНоменклатуры.Ссылка;
			
		КонецЕсли;
		
		// Упаковк по умолчанию
		ЗначениеПоУмолчанию = Справочники.УпаковкиНоменклатуры.ПустаяСсылка();
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьУпаковку(СтрокаТаблицыФормы.УпаковкаПоУмолчанию, СтрокаТаблицыФормы.УпаковкаПоУмолчанию_ВходящиеДанные, СтрокаТаблицыФормы.Номенклатура, ЗначениеПоУмолчанию);
		
		// Коэффициент
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Коэффициент, СтрокаТаблицыФормы.Коэффициент_ВходящиеДанные, 1);
		
		Если НЕ ЭтаСтрокаСопоставлена
			И ЗначениеЗаполнено(СтрокаТаблицыФормы.НоменклатураНаименование) Тогда
						
			ЭлементСправочника = Справочники.Номенклатура.СоздатьЭлемент();	
			ЭлементСправочника.Заполнить(Новый Структура("Родитель", СтрокаТаблицыФормы.Родитель));
			ЗаполнитьЗначенияСвойств(ЭлементСправочника, СтрокаТаблицыФормы, , ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СтандартныеИменаПолейНеподлежащихОбновлению(ПараметрыСопоставления.НастройкиЗагрузкиДанных));
			ЭлементСправочника.Записать();
			СтрокаТаблицыФормы.Номенклатура = ЭлементСправочника.Ссылка;
			
			ЭлементСправочника.Наименование = СтрокаТаблицыФормы.НоменклатураНаименование;
			ЭлементСправочника.НаименованиеПолное = ?(ПустаяСтрока(СтрокаТаблицыФормы.НоменклатураНаименованиеПолное), СтрокаТаблицыФормы.НоменклатураНаименование, СтрокаТаблицыФормы.НоменклатураНаименованиеПолное);
			ЭлементСправочника.ЭтоУслуга = ?(ЭлементСправочника.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга, Истина, Ложь);
			ЭлементСправочника.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.шт;
						
			Если Не ЗначениеЗаполнено(СтрокаТаблицыФормы.УпаковкаПоУмолчанию)
				И ЗначениеЗаполнено(СтрокаТаблицыФормы.УпаковкаПоУмолчанию_ВходящиеДанные) Тогда
				
				// Создать упаковку по умолчанию
				НоваяУпаковка = Справочники.УпаковкиНоменклатуры.СоздатьЭлемент();
				НоваяУпаковка.Владелец     = ЭлементСправочника.Ссылка;
				НоваяУпаковка.Наименование = СтрокаТаблицыФормы.УпаковкаПоУмолчанию_ВходящиеДанные;
				НоваяУпаковка.Коэффициент  = СтрокаТаблицыФормы.Коэффициент;
				НоваяУпаковка.Записать();
			 
				ЭлементСправочника.УпаковкаПоУмолчанию = НоваяУпаковка.Ссылка;
				СтрокаТаблицыФормы.УпаковкаПоУмолчанию = НоваяУпаковка.Ссылка;
								
			КонецЕсли;
			
			ЭлементСправочника.Записать();

		КонецЕсли;
				
		// Если ПолноеИмяОбъектаЗаполнения = "Документ.ВозвратПоставщику.ТабличнаяЧасть.Запасы" Тогда
		//	
		Если СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Запас И СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.ПодарочныйСертификат И СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Материал Тогда			
			СтрокаТаблицыФормы.Номенклатура = Неопределено;			
		КонецЕсли;
			
			//// Партия по Владельцу и Наименованию
			// ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьПартию(СтрокаТаблицыФормы.Партия, СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.Штрихкод, СтрокаТаблицыФормы.Партия_ВходящиеДанные);
						
			// ХарактеристикаСсылка = Справочники.ПартииНоменклатуры.ПустаяСсылка();
			Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
				
				СсылкаНомеклатуры = СтрокаТаблицыФормы.Номенклатура.Ссылка;
				Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Партия_ВходящиеДанные) Тогда
					
					НомеклатураОбъект = СсылкаНомеклатуры.ПолучитьОбъект();
					Если НомеклатураОбъект.ИспользоватьПартии = Ложь Тогда
						НомеклатураОбъект.ИспользоватьПартии = Истина;
						НомеклатураОбъект.Записать();
					КонецЕсли;
					
					НоваяХарактеристика = Справочники.ПартииНоменклатуры.Выбрать(, СсылкаНомеклатуры, Новый Структура("Наименование", СтрокаТаблицыФормы.Партия_ВходящиеДанные));
					Если НоваяХарактеристика.Следующий() Тогда
						СтрокаТаблицыФормы.Партия = НоваяХарактеристика.Ссылка;
					Иначе
						НоваяХарактеристика              = Справочники.ПартииНоменклатуры.СоздатьЭлемент();
						НоваяХарактеристика.Владелец     = СсылкаНомеклатуры;
						НоваяХарактеристика.Наименование = СтрокаТаблицыФормы.Партия_ВходящиеДанные;
						НоваяХарактеристика.Записать();
						СтрокаТаблицыФормы.Партия = НоваяХарактеристика.Ссылка;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
	
		// КонецЕсли;
								
		// Количество
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Количество, СтрокаТаблицыФормы.Количество_ВходящиеДанные, 1);
		
		// Цена
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Цена, СтрокаТаблицыФормы.Цена_ВходящиеДанные, 0);
		
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения);
		
		ЗагрузкаДанныхИзВнешнегоИсточника.ПрогрессСопоставленияДанных(ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицыФормы), РазмерТаблицыДанных);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаСопоставленияДанных, АдресРезультата);
	
КонецПроцедуры

Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	
	Если ПолноеИмяОбъектаЗаполнения = "Документ.ОприходованиеЗапасов.ТабличнаяЧасть.Запасы" Тогда
		
		СтрокаТаблицыФормы[ИмяСлужебногоПоля] = ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура)
			И СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас ИЛИ СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат 
			ИЛИ СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Материал И СтрокаТаблицыФормы.Количество <> 0;
				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
